// Текст комментариев
#include <iostream> // Подключение библиотеки ввода/вывода
#include <fstream>
#include <string>
#include <stdlib.h>
#include <cstdlib>
#include <math.h>
// #include <Windows.h> // Для русского языка

#include "list.h"
#include "stack.h"
#include "queue.h"
#include "vector.h"
#include "set.h"

using namespace std;

/*
 * Задача
 *
 * На вход функции подается массив строк.
 * Необходимо найти и вернуть максимально длинный префикс (часть идущую в начале строки) одинаковый у всех строк.
 * Если строки не одинаковые вовсе - вернуть пустую строку
 *
 * "flower","flow","flight" -> "fl"
 *
 * "dog","racecar","car" -> ""
 *
 */

/*
 * Задача
 *
 * На вход функции подается массив чисел - от 0 до 100
 * Необходимо вернуть максимальное, составленное из этих чисел, число.
 * [2, 3, 15] -> 3215
 * [9, 42, 33] -> 94233
 * [4, 5, 42, 35] -> 544235
 * [5, 6, 62, 35, 19] -> 66253519
 *
 */

/*
 * Задача
 *
 * На вход функции подается массив чисел - это разбитое на разряды число: 321 -> [3,2,1]
 * Нужно прибавить к исходному числу 1 и вернуть массив измененного числа
 *
 * 321 -> [3,2,1] -> [3,2,2] -> 322
 * 999 -> [9,9,9] -> [1,0,0,0] -> 1000
 */

/*
 * Задача
 *
 * На вход функции подается массив чисел. Нужно вернуть число, которое встречается в массиве лишь раз
 *
 */


int main() // Это главная функция программы - Ее начало и ее конец
{
    // setlocale(LC_ALL, "RUS");
    // setConsoleCP(1251);
    // setConsoleOutputCP(1251);




    return 0;
}





